app/Controllers/Api/AuthController.php

            $form_data['password'] = md5($this->request->getVar("password"));
            $user = new User();
            /** Check Email exist or not */
            $existEmail = $user->where(['email' => $form_data['email'], 'deleted_at' => null])->first();
---
SELECT *
FROM `users`
WHERE `email` = 'aa@aa.aa'
AND `deleted_at` IS NULL
AND `users`.`deleted_at` IS NULL
 LIMIT 1

            } else {
                /** Save new user  */
                $user = new User();
                $created = $user->save($form_data);
---
INSERT INTO `users` (`firstname`, `lastname`, `email`, `password`, `created_at`, `updated_at`) VALUES ('vv', 'ttttt', 'aa@aa.aa', 'e10adc3949ba59abbe56e057f20f883e', '2022-06-13 08:48:29', '2022-06-13 08:48:29')

    public function login()
    {
        $rules = [
            "email" => "required|valid_email|min_length[6]",
            "password" => "required",
        ];

        $messages = [
            "email" => [
                "required" => "Email is required."
            ],
            "password" => [
                "required" => "Passwod is required."
            ],
        ];

        if (!$this->validate($rules, $messages)) {
            return $this->respond(['status' => false, 'message' => $this->validator->getErrors()], 400);
        } else {
            $form_data['email'] = $this->request->getVar("email");
            $form_data['password'] = md5($this->request->getVar("password"));
            $user = new User();
            $existEmail = $user->where(['email' => $form_data['email'], 'deleted_at' => null])->first();
---
SELECT *
FROM `users`
WHERE `email` = 'aa@aa.aa'
AND `deleted_at` IS NULL
AND `users`.`deleted_at` IS NULL
 LIMIT 1