app/Controllers/Api/ResetPasswordController.php

    public function forgotpassword()
    {
        /** Valdiation rules and messages */
        $rules = [
            "email" => "required|valid_email|min_length[6]",
        ];
        $messages = [
            "email" => [
                "required" => "Email is required.",
                "valid_email" => "Email address is not in format.",
                "is_unique" => "Email address already exists."
            ]
        ];
        if (!$this->validate($rules, $messages)) {
            return $this->respond(['status' => false, 'message' => $this->validator->getErrors()], 400);
        } else {
            $form_data['email'] = $this->request->getVar("email");
            $user = new User();
            /** Check Email exist or not */
            $existEmail = $user->where(['email' => $form_data['email'], 'deleted_at' => null])->first();
---
SELECT *
FROM `users`
WHERE `email` = 'vasutamrakar.synsoft+1@gmail.com'
AND `deleted_at` IS NULL
AND `users`.`deleted_at` IS NULL
 LIMIT 1

                    $existEmail = $ResetPassword->where(['email' => $decoded->email, 'token' => $token])->first();
                    if ($existEmail) {
                        /** update user password */
                        $updated = $user->update($existEmail['user_id'], ['password' => $new_pass, 'updated_at' => date('Y-m-d H:i:s')]);
                        $ResetPassword->where('email', $existEmail['email'])->delete();
---
UPDATE `users` SET `password` = 'e10adc3949ba59abbe56e057f20f883e', `updated_at` = '2022-06-13 08:14:57'
WHERE `users`.`id` IN ('2')
DELETE FROM `reset_password`
WHERE `email` = 'vasutamrakar.synsoft+1@gmail.com'