app/Controllers/Api/UserController.php

    public function index()
    {

        $key = getenv('TOKEN_SECRET');
        $header = $this->request->getServer('HTTP_AUTHORIZATION');

        if (!$header) return $this->failUnauthorized('Token Required');
        $token = explode(' ', $header)[1];
        try {
            /** token decode */
            $decoded = JWT::decode($token, new Key($key, 'HS256'));
            $user = new User();
            /* get User */
            $userdata = $user->find($decoded->id);
---
SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
AND `users`.`id` = '5'